Tekla Open API Reference for Tekla Structures 2025
BendSurface Constructor (Arc, Double, Double)
 Initializes a new instance of the BendSurface class from a base arc, a height and a radius at the top. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BendSurface(
	Arc baseArc,
	double height,
	double radiusAtHeight
)
Public Sub New (
	baseArc As Arc,
	height As Double,
	radiusAtHeight As Double
)
Parameters
baseArc
Type: Tekla.Structures.Geometry3d.Arc
Arc to form the base of the bend surface
height
Type: System.Double
Height of the surface measured along the normal of the arc, may be positive or negative, but always nonzero
radiusAtHeight
Type: System.Double
Radius of the arc located at the given height. Must be positive
Exceptions
Exception | Condition
ArgumentException | Thrown if the given lengths are invalid
See Also
Reference
BendSurface Class
BendSurface Overload
Tekla.Structures.Model Namespace